FranciscoLlobet/efm32-freertos-zig/csrc/system/cc3100-sdk/examples/email/email.c
/*
 * email.c - function implementation to send email
 *
 * Copyright (C) 2014 Texas Instruments Incorporated - http://www.ti.com/
 *
 *
 * All rights reserved. Property of Texas Instruments Incorporated.
 * Restricted rights to use, duplicate or disclose this code are
 * granted through contract.
 *
 * The program may not be used without the written permission of
 * Texas Instruments Incorporated or against the terms and conditions
 * stipulated in the agreement under which this program has been supplied,
 * and under no circumstances can it be used with non-TI connectivity device.
 *
 */

/*
 * Protocol Name     -  Simple Mail Transfer Protocol
 * Protocol Overview -  The objective of the Simple Mail Transfer Protocol (SMTP) is to
 *                      transfer mail reliably and efficiently.SMTP is independent of the
 *                      particular transmission subsystem and requires only a reliable
 *                      ordered data stream channel.
 *                      Refer: https://www.ietf.org/rfc/rfc2821.txt
 */

#include "email.h"
#include "base64.h"
#include "config.h"
#include "sl_common.h"

/*NetApp Email protocol types */
#define SL_NET_APP_SMTP_PROTOCOL        (1)
#define INVALID_SOCKET_DESC             0xFFFFFFFF

/* Strings used to configure the Email msg in proper format */
const _u8 smtp_helo[] = {'H','E','L','O','\0'};
const _u8 smtp_mail_from[]={'M','A','I','L',' ','F','R','O','M',':',' ','\0'};
const _u8 smtp_rcpt[] = {'R','C','P','T',' ','T','O',':',' ','\0'};
const _u8 smtp_data[] = "DATA";
const _u8 smtp_crlf[] = "\r\n";
const _u8 smtp_dcrlf[] = "\r\n\r\n";
const _u8 smtp_subject[] = "Subject: ";
const _u8 smtp_to[] = "To: ";
const _u8 smtp_from[] = "From: ";
/* <CRLF>.<CRLF> Terminates the data portion */
const _u8 smtp_data_end[] = {'\r','\n','.','\r','\n','\0'};
const _u8 smtp_quit[] = {'Q','U','I','T','\r','\n','\0'};

/* Return Codes */
const _u8 smtp_code_ready[] = {'2','2','0','\0'};
const _u8 smtp_ok_reply[] = {'2','5','0','\0'};
const _u8 smtp_intermed_reply[] = {'3','5','4','\0'};
const _u8 smtp_auth_reply[] = {'3','3','4','\0'};
const _u8 smtp_auth_success[] = {'2','3','5','\0'};

/* states for smtp state machine */
typedef enum
{
    smtpINACTIVE = 0,
    smtpINIT,
    smtpHELO,
    smtpAUTH,
    smtpFROM,
    smtpRCPT,
    smtpDATA,
    smtpMESSAGE,
    smtpQUIT,
    smtpERROR
}_SlsmtpStatus_e;

/* Initialize SMTP State Machine */
_u16 g_smtpStatus = smtpINIT;

_u16 g_EmailSetStatus = 0;

/* error handling flags for smtp state machine */
typedef enum
{
    smtpNOERROR = 0,
    atINIT,
    atHELO,
    atAUTH,
    atFROM,
    atRCPT,
    atDATA,
    atMESSAGE,
    atQUIT
}_SlsmtpERROR_e;

/* Initialize Error handling flag */
_u16 g_smtpErrorInfo = smtpNOERROR;
_i32 smtpSocket;
_u8 g_cmdBuf[SMTP_BUF_LEN];
_u8 buf[SMTP_BUF_LEN];
_u8 basekey1[BASEKEY_LEN];
_u8 basekey2[BASEKEY_LEN];
_u8 message[MAX_MESSAGE_LEN];

SlNetAppEmailOpt_t g_EmailOpt;
SlNetAppSourceEmail_t g_Email;
SlNetAppSourcePassword_t g_SourcePass;
SlNetAppDestination_t g_Destination;
SlNetAppEmailSubject_t g_Subject;

_u8 email_rfc[MAX_EMAIL_RCF_LEN];

static _i32 _smtpConnect(void);
static _i32 _smtpSend(void);
static void _smtpHandleERROR(_u8 * servermessage);
static _i32 _sendSMTPCommand(_i32 socket, _u8 * cmd, _u8 * cmdparam, _u8 * respBuf);
static void _generateBase64Key(_u8 * basekey1, _u8 * basekey2);


/*!
    \brief This function sets the email parameters

    \param[in]      command -   Command send for processing
    \param[in]      pValueLen - Length of data to be processed
    \param[in]      pValue -     Data to be processed

    \return         0 for success, -1 otherwise

    \note

    \warning
*/
_i32 sl_NetAppEmailSet(_u8 command ,_u8 pValueLen,
                      _u8 *pValue)
{

    SlNetAppEmailOpt_t* pEmailOpt = 0;
    SlNetAppSourceEmail_t* pSourceEmail = NULL;
    SlNetAppSourcePassword_t* pSourcePassword = NULL;
    SlNetAppDestination_t* pDestinationEmail = NULL;
    SlNetAppEmailSubject_t* pSubject = NULL;

    switch (command)
    {
      case NETAPP_ADVANCED_OPT:
        pEmailOpt = (SlNetAppEmailOpt_t*)pValue;

        g_EmailOpt.Port = pEmailOpt->Port;
        g_EmailOpt.Family = pEmailOpt->Family;
        g_EmailOpt.SecurityMethod = pEmailOpt->SecurityMethod;
        g_EmailOpt.SecurityCypher = pEmailOpt->SecurityCypher;
        g_EmailOpt.Ip = pEmailOpt->Ip;

        g_EmailSetStatus+=1;
        break;

      case NETAPP_SOURCE_EMAIL:
        pSourceEmail = (SlNetAppSourceEmail_t*)pValue;
        pal_Memset(g_Email.Username, '\0', MAX_USERNAME_LEN);
        pal_Memcpy(g_Email.Username, pSourceEmail->Username, pValueLen);

        g_EmailSetStatus+=2;

        break;

      case NETAPP_PASSWORD:
        pSourcePassword = (SlNetAppSourcePassword_t*)pValue;
        pal_Memset(g_SourcePass.Password, '\0', MAX_PASSWORD_LEN);
        pal_Memcpy(g_SourcePass.Password, pSourcePassword->Password, pValueLen);

        g_EmailSetStatus+=4;

        break;

      case NETAPP_DEST_EMAIL:
        pDestinationEmail=(SlNetAppDestination_t*)pValue;
        pal_Memset(g_Destination.Email, '\0', MAX_DEST_EMAIL_LEN);
        pal_Memcpy(g_Destination.Email, pDestinationEmail->Email, pValueLen);

        g_EmailSetStatus+=8;

        break;

      case NETAPP_SUBJECT:
        pSubject=(SlNetAppEmailSubject_t*)pValue;
        pal_Memset(g_Subject.Value, '\0', MAX_SUBJECT_LEN);
        pal_Memcpy(g_Subject.Value, pSubject->Value, pValueLen);

        g_EmailSetStatus+=16;

        break;

      case NETAPP_MESSAGE:
        if(pValueLen > (MAX_MESSAGE_LEN - 1))
        {
            ASSERT_ON_ERROR(EMAIL_SET_INVALID_MESSAGE);
        }
        pal_Memset(message, '\0', MAX_MESSAGE_LEN);
        pal_Memcpy(message ,pValue, pValueLen);
        break;

      default:
        CLI_Write((_u8*)"\n\rError:Default case\n\r");
        ASSERT_ON_ERROR(EMAIL_SET_INVALID_CASE);
    }

    return SUCCESS;
}

/*!
    \brief Create a secure socket and connects to SMTP server

    \param[in]      none

    \return         0 if success and negative in case of error

    \note

