FranciscoLlobet/efm32-freertos-zig/csrc/system/cc3100-sdk/examples/email/email.c
    \warning
*/
_i32 sl_NetAppEmailConnect()
{
    if (!(g_EmailSetStatus >= 0x07))
    {
        CLI_Write((_u8*)"\n\rError:Email and Subject is not configured\n\r");
        ASSERT_ON_ERROR(EMAIL_CONNECT_INVALID_CONFIURATION);
    }

    return _smtpConnect();
}

/*!
    \brief Check the connection status and sends the Email

    \param[in]      none

    \return         0 if success otherwise -1

    \note

    \warning
*/
_i32 sl_NetAppEmailSend()
{
    _i32 retVal = -1;
    retVal = _smtpSend();
    if(retVal < 0)
        sl_Close(smtpSocket);

    return retVal;
}


/*!
    \brief Creates a secure socket and connects to SMTP server

    \param[in]      none

    \return         0 if success and negative in case of error

    \note

    \warning
*/
static _i32 _smtpConnect(void)
{
    SlSockAddrIn_t  LocalAddr;
    SlTimeval_t     tTimeout;
    _i32           cipher = 0;
    _i32           LocalAddrSize = 0;
    _i8            method = 0;
    _i32            Status = 0;

    LocalAddr.sin_family = g_EmailOpt.Family;
    LocalAddr.sin_port = sl_Htons(g_EmailOpt.Port);
    LocalAddr.sin_addr.s_addr = sl_Htonl(g_EmailOpt.Ip);
    LocalAddrSize = sizeof(SlSockAddrIn_t);

    /* If TLS is required */
    if(g_EmailOpt.SecurityMethod <= 5)
    {
        /* Create secure socket */
        smtpSocket = sl_Socket(SL_AF_INET, SL_SOCK_STREAM, SL_SEC_SOCKET);
        ASSERT_ON_ERROR(smtpSocket);

        tTimeout.tv_sec = 10;
        tTimeout.tv_usec = 90000;
        Status = sl_SetSockOpt(smtpSocket, SOL_SOCKET, SL_SO_RCVTIMEO,
                               &tTimeout, sizeof(SlTimeval_t));
        ASSERT_ON_ERROR(Status);

        method = g_EmailOpt.SecurityMethod;
        cipher = g_EmailOpt.SecurityCypher;

        /* Set Socket Options that were just defined */
        Status = sl_SetSockOpt(smtpSocket, SL_SOL_SOCKET, SL_SO_SECMETHOD,
                               &method, sizeof(method));
        if( Status < 0 )
        {
            sl_Close(smtpSocket);
            ASSERT_ON_ERROR(Status);
        }
        Status = sl_SetSockOpt(smtpSocket, SL_SOL_SOCKET, SL_SO_SECURE_MASK,
                               &cipher, sizeof(cipher));
        if( Status < 0 )
        {
            sl_Close(smtpSocket);
            ASSERT_ON_ERROR(Status);
        }
    }
    /* If no TLS required */
    else
    {
        /* Create socket */
        smtpSocket = sl_Socket(SL_AF_INET, SL_SOCK_STREAM, SL_IPPROTO_TCP);
        ASSERT_ON_ERROR(smtpSocket);
    }

    /* connect to socket */
    Status = sl_Connect(smtpSocket, (SlSockAddr_t *)&LocalAddr, LocalAddrSize);
    if((Status < 0) && (SL_ESECSNOVERIFY != Status))
    {
        ASSERT_ON_ERROR(Status);
    }

    return SUCCESS;
}

/*!
    \brief This function will send the email

    \param[in]      none

    \return         0 if success otherwise -1

    \note

    \warning
*/
static _i32 _smtpSend(void)
{
    _i16 exit = 0;
    _i32 retVal = -1;

    /* If socket has been opened, check for acknowledge from SMTP server */
    while(exit == 0)
    {
        switch(g_smtpStatus)
        {
            /*
             * An SMTP session is initiated when a client opens a connection to
             * a server and the server responds with an opening message.
             */
            case smtpINIT:
                /* Create buffer, Read so we can check for 220 'OK' from server */
                pal_Memset(buf, 0, SMTP_BUF_LEN);

                retVal = sl_Recv(smtpSocket, buf, sizeof(buf), 0);
                if(retVal <= 0)
                {
                    ASSERT_ON_ERROR(TCP_RECV_ERROR);
                }

                /* If buffer has 220, set state to HELO */
                if(buf[0] == smtp_code_ready[0] &&
                   buf[1] == smtp_code_ready[1] &&
                   buf[2] == smtp_code_ready[2])
                {
                    g_smtpStatus = smtpHELO;
                }
                /* Else error, set state to ERROR */
                else
                {
                    g_smtpStatus = smtpERROR;
                    g_smtpErrorInfo = atINIT;
                }
            break;

            /*
             * The client normally sends the EHLO command to the
             * server, indicating the client's identity.  In addition to opening the
             * session, use of EHLO indicates that the client is able to process
             * service extensions and requests that the server provide a list of the
             * extensions it supports.
             */
            case smtpHELO:
                retVal = _sendSMTPCommand(smtpSocket, "HELO localhost", NULL, buf);
                ASSERT_ON_ERROR(retVal);

                /* If response has 250, set state to AUTH */
                if(buf[0] == smtp_ok_reply[0] &&
                   buf[1] == smtp_ok_reply[1] &&
                   buf[2] == smtp_ok_reply[2])
                {
                    g_smtpStatus = smtpAUTH;
                }
                /* Else error, set state to ERROR */
                else
                {
                    g_smtpStatus = smtpERROR;
                    g_smtpErrorInfo = atHELO;
                }
            break;

            /* The client sends the AUTH command with SASL mechanism to use with */
            case smtpAUTH:
                /*
                 * SASL PLain - Authentication with server username and password
                 * Refer - http://www.ietf.org/rfc/rfc4616.txt
                 */
                _generateBase64Key((_u8*)g_Email.Username, basekey1);
                _generateBase64Key((_u8*)g_SourcePass.Password, basekey2);

                /* Send request to server for authentication */
                retVal = _sendSMTPCommand(smtpSocket, "AUTH LOGIN", NULL, buf);
                ASSERT_ON_ERROR(retVal);
                /* If response has 334, give username in base64 */
                if(buf[0] == smtp_auth_reply[0] &&
                   buf[1] == smtp_auth_reply[1] &&
                   buf[2] == smtp_auth_reply[2])
                {
                    retVal = _sendSMTPCommand(smtpSocket, basekey1, NULL, buf);
                    ASSERT_ON_ERROR(retVal);
                    /* If response has 334, give password in base64 */
                    if(buf[0] == smtp_auth_reply[0] &&
                       buf[1] == smtp_auth_reply[1] &&
                       buf[2] == smtp_auth_reply[2])
                    {
                        retVal = _sendSMTPCommand(smtpSocket, basekey2, NULL, buf);
                        ASSERT_ON_ERROR(retVal);
                    }
                }

                if(buf[0] == smtp_auth_success[0] &&
                   buf[1] == smtp_auth_success[1] &&
                   buf[2] == smtp_auth_success[2])
                {
                    /* Authentication was successful, set state to FROM */
                    g_smtpStatus = smtpFROM;
                }
                /* Else error, set state to ERROR */
                else
                {
                    g_smtpStatus = smtpERROR;
                    g_smtpErrorInfo = atAUTH;
                }
            break;

