FranciscoLlobet/efm32-freertos-zig/csrc/system/cc3100-sdk/examples/email/email.c
            /*
             * The SMTP transaction starts with a MAIL command which includes the
             * sender information
             * MAIL FROM:<reverse-path> [SP <mail-parameters> ] <CRLF>
             */
            case smtpFROM:
                retVal = _sendSMTPCommand(smtpSocket, (_u8 *)smtp_mail_from,
                                 (_u8 *)g_Email.Username, buf);
                ASSERT_ON_ERROR(retVal);

                /* If response has 250, set state to RCPT */
                if(buf[0] == smtp_ok_reply[0] &&
                   buf[1] == smtp_ok_reply[1] &&
                   buf[2] == smtp_ok_reply[2])
                {
                    g_smtpStatus = smtpRCPT;
                }
                else
                {
                    pal_Memset(email_rfc,'\0',MAX_EMAIL_RCF_LEN);
                    pal_Memcpy(email_rfc,"<",1);
                    pal_Memcpy(&email_rfc[1], g_Email.Username,
                           pal_Strlen(g_Email.Username));
                    pal_Memcpy(&email_rfc[1+pal_Strlen(g_Email.Username)],">",1);

                    retVal = _sendSMTPCommand(smtpSocket, (_u8 *)smtp_mail_from,
                                     email_rfc, buf);
                    ASSERT_ON_ERROR(retVal);

                    if(buf[0] == smtp_ok_reply[0] &&
                       buf[1] == smtp_ok_reply[1] &&
                       buf[2] == smtp_ok_reply[2])
                    {
                        g_smtpStatus = smtpRCPT;
                    }
                    else
                    {
                        g_smtpStatus = smtpERROR;
                        g_smtpErrorInfo = atFROM;
                    }
                }
            break;

            /* Send the destination email to the smtp server
             * RCPT TO:<forward-path> [ SP <rcpt-parameters> ] <CRLF>
             */
            case smtpRCPT:
                retVal = _sendSMTPCommand(smtpSocket, (_u8 *)smtp_rcpt,
                                 (_u8 *)g_Destination.Email, buf);
                ASSERT_ON_ERROR(retVal);

                /* If response has 250, set state to DATA */
                if(buf[0] == smtp_ok_reply[0] &&
                   buf[1] == smtp_ok_reply[1] &&
                   buf[2] == smtp_ok_reply[2])
                {
                    g_smtpStatus = smtpDATA;
                }
                else
                {
                    pal_Memset(email_rfc,'\0',MAX_EMAIL_RCF_LEN);
                    pal_Memcpy(email_rfc,"<",1);
                    pal_Memcpy(&email_rfc[1], g_Destination.Email,
                           pal_Strlen(g_Destination.Email));
                    pal_Memcpy(&email_rfc[1+pal_Strlen(g_Destination.Email)],">",1);
                    retVal = _sendSMTPCommand(smtpSocket, (_u8 *)smtp_rcpt,email_rfc, buf);
                    ASSERT_ON_ERROR(retVal);
                    /* If response has 250, set state to DATA */
                    if(buf[0] == smtp_ok_reply[0] &&
                       buf[1] == smtp_ok_reply[1] &&
                       buf[2] == smtp_ok_reply[2])
                    {
                        g_smtpStatus = smtpDATA;
                    }
                    else
                    {
                        g_smtpStatus = smtpERROR;
                        g_smtpErrorInfo = atRCPT;
                    }
                }
            break;

            /*Send the "DATA" message to the server, indicates client is ready
            * to construct the body of the email
            * DATA <CRLF>
            */
            case smtpDATA:
                retVal = _sendSMTPCommand(smtpSocket, (_u8 *)smtp_data, NULL, buf);
                ASSERT_ON_ERROR(retVal);
                /* If Response has 250, set state to MESSAGE */
                if(buf[0] == smtp_intermed_reply[0] &&
                buf[1] == smtp_intermed_reply[1] && buf[2] == smtp_intermed_reply[2])
                {
                    g_smtpStatus = smtpMESSAGE;
                }
                else
                {
                    g_smtpStatus = smtpERROR;
                    g_smtpErrorInfo = atDATA;
                }
            break;

            case smtpMESSAGE:
                /* Send actual Message, preceded by FROM, TO and Subject */

                /* Start with E-Mail's "Subject:" field */
                retVal = _sendSMTPCommand(smtpSocket, (_u8 *)smtp_subject,
                                                (_u8 *)g_Subject.Value, NULL);
                ASSERT_ON_ERROR(retVal);

                /* Add E-mail's "To:" field */
                retVal = _sendSMTPCommand(smtpSocket, (_u8 *)smtp_to,
                                            (_u8 *)g_Destination.Email, NULL);
                ASSERT_ON_ERROR(retVal);

                /* Add E-mail's "From:" field */
                retVal = _sendSMTPCommand(smtpSocket, (_u8 *)smtp_from,
                                                (_u8 *)g_Email.Username, NULL);
                ASSERT_ON_ERROR(retVal);

                /* Send CRLF */
                retVal = sl_Send(smtpSocket,smtp_crlf,pal_Strlen(smtp_crlf),0);
                if(retVal <= 0)
                    ASSERT_ON_ERROR(TCP_SEND_ERROR);

                /* Send body of message */
                retVal = _sendSMTPCommand(smtpSocket, message, NULL, NULL);
                ASSERT_ON_ERROR(retVal);

                /* End Message */
                retVal = _sendSMTPCommand(smtpSocket,(_u8 *)smtp_data_end,NULL,buf);
                ASSERT_ON_ERROR(retVal);

                /* Server will send 250 for successful. Move into QUIT state. */
                if(buf[0] == smtp_ok_reply[0] && buf[1] == smtp_ok_reply[1] &&
                                                        buf[2] == smtp_ok_reply[2])
                {
                    /* Disconnect from server by sending QUIT command */
                    retVal = sl_Send(smtpSocket,smtp_quit,pal_Strlen(smtp_quit),0);
                    if(retVal <= 0)
                        ASSERT_ON_ERROR(TCP_SEND_ERROR);

