FranciscoLlobet/efm32-freertos-zig/csrc/system/cc3100-sdk/examples/email/email.c
                    /* Close socket and reset */
                    retVal = sl_Close(smtpSocket);
                    smtpSocket = INVALID_SOCKET_DESC;
                    /* Reset the state machine */
                    g_smtpStatus = smtpINIT;
                    exit = 1;
                }
                else
                {
                    g_smtpStatus = smtpERROR;
                    g_smtpErrorInfo = atMESSAGE;
                }
            break;

            case smtpERROR:
                /* Error Handling for SMTP */
                _smtpHandleERROR(buf);
                /* Close socket and reset */
                retVal = sl_Close(smtpSocket);
                /*Reset the state machine */
                g_smtpStatus = smtpINIT;

                ASSERT_ON_ERROR(SMTP_ERROR);

            default:
                ASSERT_ON_ERROR(SMTP_INVALID_CASE);
        }
    }

    return SUCCESS;
}

/*!
    \brief This function converts the string to Base64 format needed for
           authentication

    \param[in]      input - pointer to string to be converted
    \param[out]     basekey1 - Pointer to string for base64 converted output

    \return         None

    \note

    \warning
*/
static void _generateBase64Key(_u8 *input, _u8 *basekey1)
{
    _u8 *pIn = input;

    /* Convert to base64 format  */
    ConvertToBase64(basekey1, (void *)pIn, pal_Strlen(input));
}

/*!
    \brief Performs Error Handling for SMTP State Machine

    \param[in]      servermessage - server response message

    \return         None

    \note

    \warning
*/
static void _smtpHandleERROR(_u8 *servermessage)
{
    /* Errors are handled using flags set in the smtpStateMachine */
    switch(g_smtpErrorInfo)
    {
        case atINIT:
            /* Server connection could not be established */
            CLI_Write((_u8*)"Server connection error.\r\n");
            CLI_Write((_u8*)servermessage);
        break;

        case atHELO:
            /* Server did not accept the HELO command from server */
            CLI_Write((_u8*)"Server did not accept HELO:\r\n");
            CLI_Write((_u8*)servermessage);
        break;

        case atAUTH:
            /* Server did not accept authorization credentials */
            CLI_Write((_u8*)"Authorization unsuccessful, ");
            CLI_Write((_u8*)"check username/password.\r\n");
            CLI_Write((_u8*)servermessage);
        break;

        case atFROM:
            /* Server did not accept source email. */
            CLI_Write((_u8*)"Email of sender not accepted by server.\r\n");
            CLI_Write((_u8*)servermessage);
        break;

        case atRCPT:
            /* Server did not accept destination email */
            CLI_Write((_u8*)"Email of recipient not accepted by server.\r\n");
            CLI_Write((_u8*)servermessage);
        break;

        case atDATA:
            /* 'DATA' command to server was unsuccessful */
            CLI_Write((_u8*)"smtp 'DATA' command not accepted by server.\r\n");
            CLI_Write((_u8*)servermessage);
        break;

        case atMESSAGE:
            /* Message body could not be sent to server */
            CLI_Write((_u8*)"Email Message was not accepted by the server.\r\n");
            CLI_Write((_u8*)servermessage);
        break;

        case atQUIT:
            /* Message could not be finalized */
            CLI_Write((_u8*)"Connection could not be properly closed.");
            CLI_Write((_u8*)" Message not sent.\r\n");
            CLI_Write((_u8*)servermessage);
        break;
    }
}

/*!
    \brief  Sends the SMTP command and receives the server response.
            If cmd and cmd parameter are NULL, it will only send <CR><LF>

    \param[in]      socket - Socket Descriptor
    \param[in]      cmd -    command to be send to server
    \param[in]      cmdparam - command parameter to be send
    \param[in]      respBuf -    Pointer to buffer for SMTP server response

    \return         None

    \note

    \warning
*/
static _i32 _sendSMTPCommand(_i32 socket, _u8 *cmd, _u8 * cmdparam, _u8 *respBuf)
{
    _i16 sendLen = 0;
    _i32 retVal = -1;

    pal_Memset(g_cmdBuf, 0, sizeof(g_cmdBuf));

    if(cmd != NULL)
    {
        sendLen = pal_Strlen(cmd);
        pal_Memcpy(g_cmdBuf,cmd,pal_Strlen(cmd));
    }

    if(cmdparam != NULL)
    {
        pal_Memcpy(&g_cmdBuf[sendLen], cmdparam, pal_Strlen(cmdparam));
        sendLen += pal_Strlen(cmdparam);
    }

    pal_Memcpy(&g_cmdBuf[sendLen], smtp_crlf, pal_Strlen(smtp_crlf));
    sendLen += pal_Strlen(smtp_crlf);
    retVal = sl_Send(socket, g_cmdBuf,sendLen,0);
    if(retVal <= 0)
        ASSERT_ON_ERROR(TCP_SEND_ERROR);

    if(respBuf != NULL)
    {
        pal_Memset(respBuf,0,SMTP_BUF_LEN);
        retVal = sl_Recv(socket, respBuf,SMTP_BUF_LEN,0);
        if(retVal <= 0)
            ASSERT_ON_ERROR(TCP_RECV_ERROR);
    }

    return SUCCESS;
}
